billing_cf/Documents/энргИзменитьНомерПломбыПрибораУчетаАбоненты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргНомерПломбПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.энргНомераПломбНаличиеПломб</xr:Item>
				<xr:Item>InformationRegister.энргНомераПломбСостояниеПозиций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьДатаУстановкиПломбы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьНомерПломбы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьИзмерители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НомераПломб</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоУстановки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргМестаУстановкиПломб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПломбы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьIDСтрокиИзмерителя</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьКлючСтроки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргМестаУстановкиПломб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстановкиСнятияПломбы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицоУстановившийСнявшийПломбу</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПломбыБыло</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПломбы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыПломб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

billing_cf/Documents/энргИзменитьНомерПломбыПрибораУчетаАбоненты/Forms/ФормаДокументаЗаменаПломбы/Ext/Form/Module.bsl
#Область СобытияФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжСобытияФормМодуль = ОбщегоНазначения.ОбщийМодуль("слжСобытияФорм");
		слжСобытияФормМодуль.ПриСозданииНаСервере(ЭтотОбъект, Объект);
		Если Параметры.Свойство("слжКлюч") Тогда			
			слжПреобразовательДанныхМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжПреобразовательДанных");
			слжТекущийОбъект 				= слжПреобразовательДанныхМодуль.ТекущийОбъектПриЧтенииНаСервере(Параметры["слжКлюч"]);			
			слжПреобразовательДанныхМодуль.ЗаполнитьДанныеФормы(Параметры["слжКлюч"],Объект);
			ПриЧтенииНаСервере(слжТекущийОбъект);			
		КонецЕсли;		
	КонецЕсли;
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргИзменитьНомерПломбыПрибораУчетаАбоненты(ЭтотОбъект);
			
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если ЗначениеЗаполнено(Объект.Абонент) Тогда
			ЗаполнитьДанныеФормыПоДаннымАбонента();		
		КонецЕсли; 		
		
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 		= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				Объект.ПериодНачисления 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()), Объект.Организация,Объект.Район);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
	
	ЗаполнитьТочкуУчетаОтбора();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьТочкуУчетаОтбора();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ДатаПриИзмененииСервер();		
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		АбонентПриИзмененииСервер();
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		СтроениеПомещениеПриИзмененииСервер();		
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)	
	СтроениеПомещениеПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаПриИзменении(Элемент)
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  	
	
	ТаблицаФормы 		= Элементы.НомераПломб;
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормы,"IDСтрокиТочки",ТекущиеДанные.IDСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные  		= Элементы.ТочкиУчета.ТекущиеДанные;
	СтрокиНомераПломб	= Объект.НомераПломб.НайтиСтроки(Новый Структура("IDСтрокиТочки", ТекущиеДанные.IDСтроки));
	Для Индекс = 0 По СтрокиНомераПломб.ВГраница() Цикл
		Объект.НомераПломб.Удалить(СтрокиНомераПломб[Индекс]);	
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиНомераПломб

&НаКлиенте
Процедура НомераПломбПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НомераПломбПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Элементы.ТочкиУчета.ТекущиеДанные = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура НомераПломбПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанныеТочкиУчета 			= Элементы.ТочкиУчета.ТекущиеДанные;
	ТекущиеДанные 						= Элементы.НомераПломб.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные.IDСтрокиТочки 	= ТекущиеДанныеТочкиУчета.IDСтроки;
	КонецЕсли;
				
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

&НаСервере
Процедура ОчиститьТабличныеЧасти()
	
	Объект.ТочкиУчета.Очистить();
	Объект.НомераПломб.Очистить();

КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииСервер()
	
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
	ОчиститьТабличныеЧасти();
	ЗаполнитьПриборыУчетаСервер();
	
КонецПроцедуры

&НаСервере
Процедура АбонентПриИзмененииСервер()
	
	ЗаполнитьДанныеФормыПоДаннымАбонента();
	ОчиститьТабличныеЧасти();
	ЗаполнитьПриборыУчетаСервер();
	
КонецПроцедуры

&НаСервере
Процедура СтроениеПомещениеПриИзмененииСервер()
	
	ДанныеКлючаПомещения 			= Обработки.энргКлючиПомещенийМенеджер.КлючПомещенияПоСтроениюИПомещению(Строение,Помещение);
	Если НЕ ДанныеКлючаПомещения.КлючПомещения = Объект.КлючПомещения Тогда
		ЗаполнитьЗначенияСвойств(Объект,ДанныеКлючаПомещения,"КлючПомещения");
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеКлючаПомещения,"ЧастныйСектор");		
	КонецЕсли;
	
	ОчиститьТабличныеЧасти();
	
	Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
		ЗаполнитьПриборыУчетаСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоДаннымАбонента() 
	СвойстваАбонента 				= "КлючПомещения,Район,Организация";
	ДанныеАбонента 					= Обработки.энргАбонентыМенеджер.ЗначенияРеквизитовОбъекта(Объект.Абонент,СвойстваАбонента);
	ЗаполнитьЗначенияСвойств(Объект,ДанныеАбонента,СвойстваАбонента);	
	ДанныеПомещенияРезультат 		= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТочкуУчетаОтбора()
	ТочкаУчета = ?(Объект.ТочкиУчета.Количество() = 0, Справочники.энргТочкиУчета.ПустаяСсылка(), Объект.ТочкиУчета[0].ТочкаУчета);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриборыУчетаСервер()
	Объект.ТочкиУчета.Очистить();
	Объект.НомераПломб.Очистить();
	
	Если не ЗначениеЗаполнено(ТочкаУчета) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана точка учета");		
		Возврат;
	КонецЕсли;	
	
	ОтборТочкиУчета 								= ?(ЗначениеЗаполнено(ТочкаУчета), ТочкаУчета, Неопределено);
	Результат 										= Обработки.энргСостояниеПриборовУчетаМенеджер.ДействующиеПриборыУчетаПомещения(Объект.Дата, Объект.Организация, Объект.Район, Объект.КлючПомещения, ОтборТочкиУчета, Истина, Новый Структура("ТолькоОткрытыеЛС", Истина));
	мПриборыУчета  									= ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	
	Выборка  										= Результат.выбрать();
	
	РезультатНомераПломб							= Обработки.энргСостояниеНомеровПломбПриборовУчета.ТекущиеНомераПломб(Объект.Дата, Объект.Организация, Объект.Район, Объект.КлючПомещения, мПриборыУчета);
	тзНомераПломб 									= РезультатНомераПломб.Выгрузить();
	ТекТочкаУчета 									= Неопределено;	
	Пока Выборка.следующий() цикл
		
		Если Не ТекТочкаУчета = Выборка.ТочкаУчета Тогда			
			IDСтрокиТочки 							= Новый УникальныйИдентификатор;
			СтрокаТочки 							= Объект.ТочкиУчета.Добавить();
			СтрокаТочки.ТочкаУчета 					= Выборка.ТочкаУчета;
			СтрокаТочки.Услуга 						= Выборка.Услуга;
			СтрокаТочки.ПриборУчета 				= Выборка.ПриборУчета;
			СтрокаТочки.IDСтроки 					= IDСтрокиТочки;
			
			СтрокиПломб 							= тзНомераПломб.НайтиСтроки(Новый Структура("ПриборУчета", Выборка.ПриборУчета));
			Для Индекс = 0 По СтрокиПломб.ВГраница() Цикл
				СтрокаПломбы 						= Объект.НомераПломб.Добавить();
				СтрокаПломбы.IDСтрокиТочки 			= СтрокаТочки.IDСтроки;
				СтрокаПломбы.МестоУстановки 		= СтрокиПломб[Индекс].МестоУстановки;
				СтрокаПломбы.НомерПломбыБыло 		= СтрокиПломб[Индекс].НомерПломбы;
			КонецЦикла; 			
		КонецЕсли;
		
		ТекТочкаУчета 								= Выборка.ТочкаУчета;			
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы_ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область Подсистема_слжСлужебная

&НаКлиенте
Процедура Подключаемый_слж_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	слжСобытияФормКлиентМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	слжСобытияФормКлиентМодуль.ОбработкаВыбораПоляВвода(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_слж_ПриИзменении(Элемент)
	
	слжСобытияФормКлиентМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	слжСобытияФормКлиентМодуль.ПолеВводаПриИзменении(Элемент, ЭтаФорма);	
	ДействиеПоУмолчанию 		= слжСобытияФормКлиентМодуль.ДействиеПриИзмененииПоУмолчанию(Элемент, ЭтаФорма);
	Если Не ПустаяСтрока(ДействиеПоУмолчанию) Тогда
		Выполнить(ДействиеПоУмолчанию+"(Элемент)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_слж_ПередЗаписью(Отказ, ПараметрыЗаписи)
	 	
	слжМодульКлиент					= ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	СтруктураДействияПоУмолчанию 	= слжМодульКлиент.СтруктураДействияПоУмолчанию(ЭтаФорма);
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПередЗаписью) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПередЗаписью+"(Отказ, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат;
		КонецЕсли;		
	КонецЕсли;
			
	Отказ 							= слжВыполнитьСлужебныеОперацииПередЗаписьюСервер(СтруктураДействияПоУмолчанию,ПараметрыЗаписи);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПослеЗаписи) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПослеЗаписи+"(ПараметрыЗаписи)");
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	Отказ 							= Истина;
	Модифицированность 				= Ложь;
	
КонецПроцедуры

&НаСервере
Функция слжВыполнитьСлужебныеОперацииПередЗаписьюСервер(СтруктураДействияПоУмолчанию,ПараметрыЗаписи)
	
	слжМодуль 					= ОбщегоНазначения.ОбщийМодуль("слжСобытияФорм");		
	слжТекущийОбъект 			= РеквизитФормыВЗначение("Объект");
	Отказ 						= Ложь;
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПередЗаписьюНаСервере) Тогда		
		Выполнить(СтруктураДействияПоУмолчанию.ПередЗаписьюНаСервере+"(Отказ, слжТекущийОбъект, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат Истина;
		КонецЕсли;		
	КонецЕсли;		
	
	Если НЕ слжТекущийОбъект.ПроверитьЗаполнение() Тогда
		Отказ 					= Истина;
		Возврат Истина;
	КонецЕсли;

	НачатьТранзакцию();		
	слжТекущийОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПриЗаписиНаСервере) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПриЗаписиНаСервере+"(Отказ, слжТекущийОбъект, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПослеЗаписиНаСервере) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПослеЗаписиНаСервере+"(слжТекущийОбъект, ПараметрыЗаписи)");
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(слжТекущийОбъект,"Объект");
	ОтменитьТранзакцию();
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
